bdcabreran/STM32-LED-Animation-PWM/Core/Src/led_animation.c
/**
 * @file led_control.c
 * @author Bayron Cabrera (bayron.nanez@gmail.com)
 * @brief
 * @version 0.1
 * @date 2024-07-12
 *
 * @copyright Copyright (c) 2024
 *
 */

#include "led_animation.h"
#include "stdbool.h"
#include "string.h"

#define PRINT_COORDINATES 0
#define PI 3.14159

#define DEBUG_BUFFER_SIZE 100
#define LED_CONTROL_DBG 1

#if LED_CONTROL_DBG
#include "stm32l4xx_hal.h"
#include <stdio.h>
extern UART_HandleTypeDef huart2;
#define LED_CONTROL_DBG_MSG(fmt, ...)                                                                                  \
    do                                                                                                                 \
    {                                                                                                                  \
        static char dbgBuff[DEBUG_BUFFER_SIZE];                                                                        \
        snprintf(dbgBuff, DEBUG_BUFFER_SIZE, (fmt), ##__VA_ARGS__);                                                    \
        HAL_UART_Transmit(&huart2, (uint8_t*)dbgBuff, strlen(dbgBuff), 1000);                                          \
    } while (0)
#else
#define LED_CONTROL_DBG_MSG(fmt, ...)                                                                                  \
    do                                                                                                                 \
    {                                                                                                                  \
    } while (0)
#endif

static LED_Status_t LED_AnimationNoneExecute(LED_Handle_t* this);
static LED_Status_t LED_AnimationSolidExecute(LED_Handle_t* this, uint32_t tick);
static LED_Status_t LED_AnimationFlashExecute(LED_Handle_t* this, uint32_t tick);
static LED_Status_t LED_AnimationBlinkExecute(LED_Handle_t* this, uint32_t tick);
static LED_Status_t LED_AnimationBreathExecute(LED_Handle_t* this, uint32_t tick);
static LED_Status_t LED_AnimationFadeInExecute(LED_Handle_t* this, uint32_t tick);
static LED_Status_t LED_AnimationFadeOutExecute(LED_Handle_t* this, uint32_t tick);
static LED_Status_t LED_AnimationPulseExecute(LED_Handle_t* this, uint32_t tick);
static LED_Status_t LED_AnimationOffExecute(LED_Handle_t* this);
static LED_Status_t LED_AnimationAlternatingColorsExecute(LED_Handle_t* this, uint32_t tick);
static LED_Status_t LED_AnimationColorCycleExecute(LED_Handle_t* this, uint32_t tick);
static void         update_exp_multiplier_factor();

typedef uint32_t (*CalculateFadeBrightness_t)(uint32_t elapsed,
                                              uint32_t duration,
                                              uint32_t maxDutyCycle,
                                              bool     isFadingIn);

#if USE_LED_ANIMATION_QUADRATIC
static uint32_t GetFadeBrightnessQuadratic(uint32_t elapsed, uint32_t duration, uint32_t maxDutyCycle, bool isFadingIn);
static const CalculateFadeBrightness_t CalculateFadeBrightness = GetFadeBrightnessQuadratic;

#elif USE_LED_ANIMATION_EXPONENTIAL
static uint32_t
GetFadeBrightnessExponential(uint32_t elapsed, uint32_t duration, uint32_t maxDutyCycle, bool isFadingIn);
static const CalculateFadeBrightness_t CalculateFadeBrightness = GetFadeBrightnessExponential;

#elif USE_LED_ANIMATION_SINE
static uint32_t GetFadeBrightnessSine(uint32_t elapsed, uint32_t duration, uint32_t maxDutyCycle, bool isFadingIn);
static const CalculateFadeBrightness_t CalculateFadeBrightness = GetFadeBrightnessSine;

#elif USE_LED_ANIMATION_SINE_APPROX
static uint32_t GetFadeBrightnessSineAprox(uint32_t elapsed, uint32_t duration, uint32_t maxDutyCycle, bool isFadingIn);
static const CalculateFadeBrightness_t CalculateFadeBrightness = GetFadeBrightnessSineAprox;

#endif

static void LED_Animation_CallCallbackIfExists(LED_Handle_t* this, LED_Status_t Status)
{
    if (this->callback != NULL)
    {
        this->callback(this->animationType, Status);
    }
}

static LED_Status_t LED_Animation_SetCurrentColor(LED_Handle_t* this, uint8_t* colorValues, uint32_t colorCount)
{
    if (this == NULL || colorValues == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }

    for (uint32_t i = 0; i < colorCount; i++)
    {
        this->currentColor[i] = colorValues[i];
    }

    return LED_STATUS_SUCCESS;
}

static LED_Status_t
LED_Animation_SetCurrentColorFromDutyCycle(LED_Handle_t* this, uint16_t* DutyCycleValues, uint32_t DutyCycleCount)
{
    void* pwmConfig = this->controller->PwmConfig;

    // Check for null pointers to ensure safety before accessing them
    if (this == NULL || this->controller == NULL || pwmConfig == NULL || DutyCycleValues == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }

    // Ensure that the DutyCycleCount does not exceed predefined limits (if applicable)
    if (DutyCycleCount > MAX_COLOR_CHANNELS)
    {
        return LED_STATUS_ERROR_INVALID_ARGUMENT;
    }

    for (uint32_t i = 0; i < DutyCycleCount; i++)
    {
        // checks to ensure DutyCycleValues[i] is within the expected range if needed
        if (DutyCycleValues[i] > this->controller->MaxDutyCycle)
        {
            return LED_STATUS_ERROR_INVALID_VALUE;
        }

        this->currentColor[i] = DUTY_CYCLE_TO_BRIGHTNESS(DutyCycleValues[i], this->controller->MaxDutyCycle);
    }

    return LED_STATUS_SUCCESS;
}

/**
 * @brief Calculates the number of color channels based on the LED type.
 *
 * This function returns the count of individual color channels for different
 * LED configurations, which is useful for setting up PWM configurations or for
 * iterating over color data arrays in a generic manner.
 *
 * @param ledType The type of LED configuration as defined in LED_Type_t.
 * @return uint32_t The number of color channels for the given LED type.
 */
uint32_t CalculateColorCount(LED_Type_t ledType)
{
    switch (ledType)
    {
    case LED_TYPE_RGB:
        return 3; // Red, Green, Blue
    case LED_TYPE_RGY:
        return 3; // Red, Green, Yellow
    case LED_TYPE_RGBW:
        return 4; // Red, Green, Blue, White
    case LED_TYPE_SINGLE_COLOR:
        return 1; // Single color channel
    case LED_TYPE_DUAL_COLOR:
        return 2; // Two color channels
    case LED_TYPE_INVALID:
    case LED_TYPE_LAST:
    default:
        return 0; // Invalid or unknown LED type
    }
}

/**
 * @brief Sets the duty cycles for PWM outputs based on provided color
 * brightness values.
 *
 * This function is ideal for high-level applications where LED control is
 * needed based on color brightness values. It takes an array of brightness
 * levels (0-LED_MAX_BRIGHTNESS), converts them to duty cycles and sets these
 * duty cycles on the specified PWM configuration.
 *
 * @param this Pointer to the LED handle containing controller information.
 * @param colorValues Array of uint8_t representing color brightness levels
 * (0-LED_MAX_BRIGHTNESS).
 * @param colorCount Number of elements in the colorValues array.
 *
 * @note This function is suitable for user interfaces or systems where color
 * control is specified in terms of standard RGB color levels. It abstracts away
 * the lower-level PWM details by automatically converting color brightness into
 * PWM duty cycles.
 */
static LED_Status_t SetColorGeneric(LED_Handle_t* this, uint8_t* colorValues, uint32_t colorCount)
{

