bdcabreran/STM32-LED-Animation-PWM/Core/Src/led_animation.c
    this->animationType = LED_ANIMATION_TYPE_FLASH;
    this->animationData = Flash;
    this->isRunning     = false;
    this->repeatTimes   = Flash->repeatTimes;
    LED_CONTROL_DBG_MSG("LED Animation Flash\r\n");

    return LED_STATUS_SUCCESS;
}

static LED_Status_t LED_AnimationFlashExecute(LED_Handle_t* this, uint32_t tick)
{
    if (this == NULL || this->animationData == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }

    LED_Animation_Flash_t* Flash = (LED_Animation_Flash_t*)this->animationData;
    if (this->isRunning == false)
    {
        return LED_STATUS_SUCCESS;
    }

    if (this->startTime == 0)
    {
        this->startTime   = tick; // set initial start time
        this->repeatTimes = Flash->repeatTimes;

        // Execute color only once
        LED_Animation_ExecuteColorSetting(this, (uint8_t*)Flash->color);
    }

    uint32_t elapsedTime   = tick - this->startTime;
    uint16_t totalPeriodMs = Flash->onTimeMs + Flash->offTimeMs;

    // Determine the action based on the elapsed time within the current period
    if (elapsedTime < Flash->onTimeMs)
    {
        this->controller->Start(); // LED on during the 'on' time
        LED_Animation_ExecuteColorSetting(this, (uint8_t*)Flash->color);
    }
    else if (elapsedTime < totalPeriodMs)
    {
        this->controller->Stop(); // LED off during the 'off' time
        LED_Animation_ClearCurrentColor(this);
    }

    // Reset for the next cycle or handle the completion
    if (elapsedTime >= totalPeriodMs)
    {
        this->startTime = tick; // Reset the start time for the next cycle
        if (HandleRepeatLogic(this, Flash->repeatTimes, false) == LED_STATUS_ANIMATION_COMPLETED)
        {
            this->animationType = LED_ANIMATION_TYPE_NONE;
        }
    }

    return LED_STATUS_SUCCESS;
}

LED_Status_t LED_Animation_SetBlink(LED_Handle_t* this, LED_Animation_Blink_t* Blink)
{
    if (this == NULL || Blink == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }

    this->animationType = LED_ANIMATION_TYPE_BLINK;
    this->animationData = Blink;
    this->isRunning     = false;
    this->repeatTimes   = Blink->repeatTimes;
    LED_CONTROL_DBG_MSG("LED Animation Blink\r\n");

    return LED_STATUS_SUCCESS;
}

static LED_Status_t LED_AnimationBlinkExecute(LED_Handle_t* this, uint32_t tick)
{
    if (this == NULL || this->animationData == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }

    LED_Animation_Blink_t* Blink = (LED_Animation_Blink_t*)this->animationData;
    if (this->isRunning == false)
    {
        return LED_STATUS_SUCCESS;
    }

    if (this->startTime == 0)
    {
        this->startTime   = tick; // set initial start time
        this->repeatTimes = Blink->repeatTimes;

        // Execute color only once
        LED_Animation_ExecuteColorSetting(this, (uint8_t*)Blink->color);
    }

    uint32_t elapsedTime = tick - this->startTime;

    // Determine if we should turn the LED on or off
    if (elapsedTime >= Blink->periodMs)
    {
        this->startTime = tick;
        if (HandleRepeatLogic(this, Blink->repeatTimes, false) == LED_STATUS_ANIMATION_COMPLETED)
        {
            this->animationType = LED_ANIMATION_TYPE_NONE;
        }
    }
    else if (elapsedTime >= Blink->periodMs / 2)
    {
        // Turn LED off after half the period
        this->controller->Stop();
        LED_Animation_ClearCurrentColor(this);
    }
    else
    {
        // Turn LED on for the first half of the period
        this->controller->Start();
        LED_Animation_ExecuteColorSetting(this, (uint8_t*)Blink->color);
    }
    return LED_STATUS_SUCCESS;
}

LED_Status_t LED_Animation_SetBreath(LED_Handle_t* this, LED_Animation_Breath_t* Breath)
{
    if (this == NULL || Breath == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }

    this->animationType = LED_ANIMATION_TYPE_BREATH;
    this->animationData = Breath;
    this->isRunning     = false;
    LED_CONTROL_DBG_MSG("LED Animation Breath\r\n");

    return LED_STATUS_SUCCESS;
}

#if USE_LED_ANIMATION_QUADRATIC
// Computes the brightness for LED animations based on a quadratic curve.
// This function is designed for both fading in and fading out effects.
//
// Parameters:
//   elapsed      - The current time elapsed since the beginning of the animation.
//   duration     - The total duration of the LED animation.
//   maxDutyCycle - The maximum brightness level (duty cycle) for the LED.
//   isFadingIn   - A boolean flag indicating whether the LED is fading in or out.
//
// Returns:
//   The computed brightness level based on a quadratic curve.
static uint32_t GetFadeBrightnessQuadratic(uint32_t elapsed, uint32_t duration, uint32_t maxDutyCycle, bool isFadingIn)
{
    // Normalize time to a range from 0 to maxDutyCycle for direct scaling
    uint32_t normalizedTime = (elapsed * maxDutyCycle) / duration;
    uint32_t expBrightness;

    if (isFadingIn)
    {
        // Calculate brightness for fading in using a quadratic approximation:
        // Brightness = (NormalizedTime / MaxDutyCycle) ^ 2
        // Simplified here by avoiding division for optimization
        expBrightness = (normalizedTime * normalizedTime) / maxDutyCycle;
    }
    else
    {
        // Calculate brightness for fading out using the inverse of the quadratic approximation:
        // Brightness = (1 - NormalizedTime / MaxDutyCycle) ^ 2
        // Simplified here by computing the inverse time first and then squaring it
        uint32_t inverseTime = maxDutyCycle - normalizedTime;
        expBrightness        = (inverseTime * inverseTime) / maxDutyCycle;
    }

    return expBrightness;
}

#endif

#if USE_LED_ANIMATION_EXPONENTIAL
#include <math.h> // Required for exp() function
// Computes the brightness for LED animations based on an exponential curve.
// This function supports both exponential growth and decay for fading in and out.
//
// Parameters:
//   elapsed      - The current time elapsed since the beginning of the animation.
//   duration     - The total duration of the LED animation.
//   maxDutyCycle - The maximum brightness level for the LED.
//   isFadingIn   - A boolean indicating whether the LED is fading in or out.
//
// Returns:
//   The computed brightness level based on an exponential curve.
static uint32_t
GetFadeBrightnessExponential(uint32_t elapsed, uint32_t duration, uint32_t maxDutyCycle, bool isFadingIn)
{
    // Normalize progress from 0.0 to 1.0
    float    progress = (float)elapsed / duration;
    uint32_t expBrightness;
    uint8_t  exponentMultiplier = 3; // Multiplier to adjust the steepness of the curve

    if (isFadingIn)
    {
        // Exponential growth formula for fading in
        expBrightness = (exp(progress * exponentMultiplier) - 1) / (exp(exponentMultiplier) - 1) * maxDutyCycle;
    }
    else
    {
        // Exponential decay formula for fading out
        expBrightness = (exp((1 - progress) * exponentMultiplier) - 1) / (exp(exponentMultiplier) - 1) * maxDutyCycle;
    }

    return expBrightness;
}

#endif

#if USE_LED_ANIMATION_SINE
#include <math.h> // Required for exp() function
static uint32_t GetFadeBrightnessSine(uint32_t elapsed, uint32_t duration, uint32_t maxDutyCycle, bool isFadingIn)
{
    // Normalize progress ranging from 0.0 to 1.0
    float progress = (float)elapsed / duration;

    uint32_t brightness;
    uint8_t  exponentMultiplier = 3;

    if (isFadingIn)
    {
        // Rise phase: using the sine function for a smooth increase
        float sineInput = sin(progress * PI / 2); // Sine wave from 0 to PI/2 (0 to 1)
        brightness      = (exp(sineInput * exponentMultiplier) - 1) / (exp(exponentMultiplier) - 1) * maxDutyCycle;
    }
    else
    {
        // Fall phase: inverse of the rise phase
        float sineInput = sin((1 - progress) * PI / 2); // Sine wave from PI/2 to 0 (1 to 0)
        brightness      = (exp(sineInput * exponentMultiplier) - 1) / (exp(exponentMultiplier) - 1) * maxDutyCycle;
    }

    return brightness;
}
#endif

////////////////////////////////////////////////////////

#if USE_LED_ANIMATION_SINE_APPROX
#include <stdint.h>

