bdcabreran/STM32-LED-Animation-PWM/Core/Src/led_animation.c
    // Calculate the total time for one full cycle of all colors
    uint32_t cycleTimeMs = AlternatingColors->durationMs * AlternatingColors->colorCount;

    // Calculate the number of full cycles completed and the time within the current cycle
    uint32_t timeInCurrentCycle = elapsedTime % cycleTimeMs;

    // Determine the current color index based on the elapsed time within the current cycle
    uint32_t colorIndex = timeInCurrentCycle / AlternatingColors->durationMs;

    // Get the current color
    uint8_t* currentColor = ((uint8_t**)AlternatingColors->colors)[colorIndex];

    // Set the LED color
    LED_Animation_ExecuteColorSetting(this, currentColor);

    // Check if the animation should stop after the specified number of repeats
    if (AlternatingColors->repeatTimes != -1 && elapsedTime >= cycleTimeMs * AlternatingColors->repeatTimes)
    {
        this->isRunning = false;
        this->controller->Stop();
        LED_Animation_ClearCurrentColor(this);
        LED_Animation_CallCallbackIfExists(this, LED_STATUS_ANIMATION_COMPLETED);
        this->animationType = LED_ANIMATION_TYPE_NONE;
    }

    return LED_STATUS_SUCCESS;
}

LED_Status_t LED_Animation_SetColorCycle(LED_Handle_t* this, LED_Animation_ColorCycle_t* ColorCycle)
{
    if (this == NULL || ColorCycle == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }

    this->animationType = LED_ANIMATION_TYPE_COLOR_CYCLE;
    this->animationData = ColorCycle;
    this->isRunning     = false;
    LED_CONTROL_DBG_MSG("LED Animation Color Cycle\r\n");

    return LED_STATUS_SUCCESS;
}

static LED_Status_t LED_AnimationColorCycleExecute(LED_Handle_t* this, uint32_t tick)
{
    // Validate input pointers
    if (this == NULL || this->animationData == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }

    // Return success if animation is not running
    if (!this->isRunning)
    {
        return LED_STATUS_SUCCESS;
    }

    LED_Animation_ColorCycle_t* ColorCycle = (LED_Animation_ColorCycle_t*)this->animationData;

    // Initialize the animation
    if (this->startTime == 0)
    {
        this->startTime   = tick;
        this->repeatTimes = ColorCycle->repeatTimes;
        this->controller->Start();
    }

    uint32_t elapsedTime = tick - this->startTime;
    uint32_t cycleTimeMs = ColorCycle->transitionMs + ColorCycle->holdTimeMs;

    // Calculate the total cycle time
    uint32_t totalCycleTimeMs = (this->repeatTimes == -1 || this->repeatTimes > 1)
                                    ? cycleTimeMs * ColorCycle->colorCount
                                    : cycleTimeMs * ColorCycle->colorCount - ColorCycle->transitionMs;

    uint32_t timeInCycle    = elapsedTime % cycleTimeMs;
    uint32_t colorIndex     = (elapsedTime / cycleTimeMs) % ColorCycle->colorCount;
    uint32_t nextColorIndex = (colorIndex + 1) % ColorCycle->colorCount;

    uint8_t* currentColor = ((uint8_t**)ColorCycle->colors)[colorIndex];
    uint8_t* nextColor    = ((uint8_t**)ColorCycle->colors)[nextColorIndex];

    // Hold phase
    if (timeInCycle < ColorCycle->holdTimeMs)
    {
        LED_Status_t result = LED_Animation_ExecuteColorSetting(this, currentColor);
        if (result != LED_STATUS_SUCCESS)
        {
            return result;
        }
    }
    // Transition phase
    else
    {
        float   fraction   = (timeInCycle - ColorCycle->holdTimeMs) / (float)ColorCycle->transitionMs;
        uint8_t colorCount = CalculateColorCount(this->controller->LedType);
        uint8_t interpolatedColor[colorCount];

        for (uint32_t i = 0; i < colorCount; i++)
        {
            uint8_t color        = currentColor[i] + fraction * (nextColor[i] - currentColor[i]);
            interpolatedColor[i] = color;
        }

        LED_Animation_ExecuteColorSetting(this, interpolatedColor);
    }

    // Handle animation completion and repetition
    if (elapsedTime >= totalCycleTimeMs)
    {
        this->startTime       = tick;
        bool StopOnCompletion = ColorCycle->leaveLastColor ? false : true;
        if (HandleRepeatLogic(this, ColorCycle->repeatTimes, StopOnCompletion) == LED_STATUS_ANIMATION_COMPLETED)
        {
            this->animationType = LED_ANIMATION_TYPE_NONE;
        }
    }

    return LED_STATUS_SUCCESS;
}

LED_Status_t LED_Animation_SetAnimation(LED_Handle_t* this, void* animationData, LED_Animation_Type_t animationType)
{
    if (this == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }

    this->animationType = animationType;
    this->animationData = animationData;
    this->isRunning     = false;

    LED_CONTROL_DBG_MSG("LED Animation Set %d\r\n", animationType);

    return LED_STATUS_SUCCESS;
}

LED_Status_t LED_Animation_GetCurrentColor(LED_Handle_t* this, uint8_t* color, uint8_t colorCount)
{
    if (this == NULL || color == NULL || colorCount == NULL)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }

    memcpy(color, this->currentColor, colorCount);

    return LED_STATUS_SUCCESS;
}

LED_Status_t LED_Animation_GetTargetColor(void* animData, LED_Animation_Type_t Type, uint8_t* color, uint8_t colorCount)
{
    if (animData == NULL || color == NULL || colorCount == 0)
    {
        return LED_STATUS_ERROR_NULL_POINTER;
    }

    // Determine the type of animation and extract the colors accordingly
    switch (Type)
    {
    case LED_ANIMATION_TYPE_SOLID:
    case LED_ANIMATION_TYPE_BLINK:
    case LED_ANIMATION_TYPE_FLASH:
    case LED_ANIMATION_TYPE_FADE_IN:
    case LED_ANIMATION_TYPE_FADE_OUT:
    case LED_ANIMATION_TYPE_PULSE:
    case LED_ANIMATION_TYPE_BREATH:
    {
        LED_Animation_Solid_t* animConfig = (LED_Animation_Solid_t*)animData;
        uint8_t*               animColor  = (uint8_t*)animConfig->color;
        for (uint32_t i = 0; i < colorCount; i++)
        {
            color[i] = animColor[i];
        }
        break;
    }

    case LED_ANIMATION_TYPE_ALTERNATING_COLORS:
    case LED_ANIMATION_TYPE_COLOR_CYCLE:
    {
        // For multi-color animations, only return the first color in the array
        LED_Animation_AlternatingColors_t* config      = (LED_Animation_AlternatingColors_t*)animData;
        uint8_t*                           targetColor = ((uint8_t**)config->colors)[0];

        for (uint16_t i = 0; i < colorCount; i++)
        {
            color[i] = targetColor[i];
            LED_CONTROL_DBG_MSG("MC Color %d: %d\r\n", i, color[i]);
        }
        break;
    }
    default:
        return LED_STATUS_ERROR_INVALID_ANIMATION_TYPE;
    }

    return LED_STATUS_SUCCESS;
}

/**
 * @brief Determines if the LED animation should start in a high state.
 *
 * @param animationType The type of LED animation.
 * @param animConfig Pointer to the animation configuration, used for specific animation types.
 * @return true if the animation should start high, false otherwise.
 */
bool LED_Animation_ShouldStartHigh(LED_Animation_Type_t animationType, void* animConfig)
{
    switch (animationType)
    {
    case LED_ANIMATION_TYPE_SOLID:
    case LED_ANIMATION_TYPE_BLINK:
    case LED_ANIMATION_TYPE_FLASH:
    case LED_ANIMATION_TYPE_FADE_OUT:
    case LED_ANIMATION_TYPE_ALTERNATING_COLORS:
        return true;

    case LED_ANIMATION_TYPE_COLOR_CYCLE:
    {
        LED_Animation_ColorCycle_t* config = (LED_Animation_ColorCycle_t*)animConfig;
        return config->leaveLastColor;
    }

    case LED_ANIMATION_TYPE_BREATH:
    {
        LED_Animation_Breath_t* config = (LED_Animation_Breath_t*)animConfig;
        return config->invert;
    }

    case LED_ANIMATION_TYPE_FADE_IN:
    case LED_ANIMATION_TYPE_PULSE:
        return false;

    default:
        return false; // Default to low if unknown animation type
    }
}

// How to Measure Machine Cycle Count
/**
#if MEASURE_CYCLES
start_cycles             = DWT->CYCCNT;
function_to_measure();
end_cycles               = DWT->CYCCNT;
// Calculate the total cycles used
total_cycles = end_cycles - start_cycles;
LED_CONTROL_DBG_MSG("Function consumed %lu cycles\r\n", total_cycles);
#else

**/
